<?php

return [
    'admins' => [
        'create' => [
            'success' => 'アカウント登録成功。',
            'fail' => 'アカウントの登録に失敗しました。',
        ],
        'update' => [
            'success' => 'アカウント情報が正常に更新されました。',
            'fail' => 'アカウント情報の更新に失敗しました。',
        ],
        'delete' => [
            'success' => 'アカウントが正常に削除されました。',
            'fail' => 'アカウントの削除に失敗しました。',
        ],
        'update_password' => [
            'success' => 'パスワードの更新が成功しました。',
            'fail' => 'パスワードの更新に失敗しました。',
        ],
    ],
    'companies' => [
        'create' => [
            'success' => '成功した企業アカウント登録。',
            'fail' => '企業アカウントの登録に失敗しました。',
        ],
        'update' => [
            'success' => '企業アカウントの更新が完了しました。',
            'fail' => '企業アカウントの更新に失敗しました。',
        ],
        'delete' => [
            'success' => '会社のアカウントが正常に削除されました。',
            'fail' => '法人アカウントの削除に失敗しました。',
        ],
        'update_password' => [
            'success' => 'パスワードの更新が成功しました。',
            'fail' => 'パスワードの更新に失敗しました。',
        ],
    ],
    'privacy_policy' => [
        'update' => [
            'success' => 'プライバシーポリシーが更新されました。',
            'fail' => 'プライバシー ポリシーを更新できません。',
        ]
    ],
    'term_of_service' => [
        'update' => [
            'success' => '利用規約を正常に更新します。',
            'fail' => '利用規約の更新に失敗しました。',
        ]
    ],
    'error_exist' => 'エラーが発生しました。開発者に通知してください。',
];
