<?php
return [
    'page_title' => [
        'logs' => '活動履歴ページ'
    ],
    'menu' => [
        'logs' => '操作履歴',
    ],
    'logs' => [
        'list' => '登録データ一覧',
        'detail' => '活動内容',
        'causer' => '実行者',
        'subject' => '対象者',
        'event' => 'イベント',
        'attributes' => '変更',
        'log_at' => '録音時間',
    ],
    'info'=> [
        'update'=>[
            'success' => '正常に更新されました。',
            'fail' => 'アップデートに失敗しました。 再試行するか、管理者に通知してください。',
        ]
    ],
    'staffs' => [
        'create' => [
            'success' => '従業員アカウントの登録に成功しました。',
            'fail' => '従業員アカウントの登録に失敗しました。 再試行するか、管理者に通知してください。'
        ],
        'update' => [
            'success' => 'アカウント情報が正常に更新されました。',
            'fail' => 'アカウント情報の更新に失敗しました。 再試行するか、管理者に通知してください。'
        ],
        'delete' => [
            'success' => 'アカウントが正常に削除されました。',
            'fail' => 'アカウントの削除に失敗しました。',
        ],
    ],
    'reports' => [
        'create' => [
            'success' => 'アーカイブ成功レポート。',
            'fail' => 'アーカイブ レポートに失敗しました。 再試行するか、管理者に通知してください。'
        ],
        'update' => [
            'success' => '成功報告を更新しました。',
            'fail' => 'レポートの更新に失敗しました。 再試行するか、管理者に通知してください。'
        ]
    ],
    'blogs' => [
        'create' => [
            'success' => '成功ブログ宣言。',
            'fail' => 'ブログの宣言に失敗しました。再試行するか、管理者に通知してください。'
        ],
        'update' => [
            'success' => 'ブログ更新成功。',
            'fail' => 'ブログの更新に失敗しました。再試行するか、管理者に通知してください。'
        ]
    ],
    'notifications' => [
        'create' => [
            'success' => '通知の保存に成功しました。',
            'fail' => 'アーカイブ 通知の保存に失敗しました。 再試行するか、管理者に通知してください。'
        ],
        'update' => [
            'success' => '更新通知が成功しました。',
            'fail' => '通知の更新に失敗しました。 再試行するか、管理者に通知してください。'
        ]
    ],
    'error_exist' => 'エラーが発生しました。管理者に通知してください。'
];
?>
